Documents/ESB/ESB_Consumer_0529/003TestSample/SAMPLE_XML_MUST/TDAccount/TD04_TDCtrctCanRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/TDAccount/TDCtrctCanRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>TDAccount</ServiceDomain>  
      <OperationName>TDCtrctCan</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:TDCtrctCanRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>TD04</v11:TxnId>  
        <v11:TxnNo>TD0400001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <!--Optional:-->  
        <v11:Payload> 
          <v11:ArrngId>NEW</v11:ArrngId> 
        </v11:Payload> 
      </v11:ServiceBody> 
    </v11:TDCtrctCanRq> 
  </soap:Body> 
</soap:Envelope>
